test/data/checkout/product.json

{
	"product": [
		{
			"id": 3424,
			"name": "Adidas Men's Fluid glow M Running Shoes!!!!!!!!!",
			"slug": "adidas-mens-fluid-glow-m-running-shoes",
			"permalink": "https://woo-store1.blynklive.com/product/adidas-mens-fluid-glow-m-running-shoes/",
			"date_created": "2021-10-12T16:17:36",
			"date_created_gmt": "2021-10-12T16:17:36",
			"date_modified": "2021-11-01T11:48:00",
			"date_modified_gmt": "2021-11-01T11:48:00",
			"type": "variable",
			"status": "publish",
			"featured": false,
			"catalog_visibility": "visible",
			"description": "<ul class=\"a-unordered-list a-vertical a-spacing-mini\">\n<li><span class=\"a-list-item\">Sole: Polyurethane</span></li>\n<li><span class=\"a-list-item\">Closure: Pull On</span></li>\n<li><span class=\"a-list-item\">Shoe Width: Medium</span></li>\n<li><span class=\"a-list-item\">Upper Material: Pu and Textile; Outer Sole: Rubber</span></li>\n<li><span class=\"a-list-item\">Closure: Slip-on; Ankle Height: Regular</span></li>\n<li><span class=\"a-list-item\">Cushioning: Medium; Insole: Padded</span></li>\n<li><span class=\"a-list-item\">Package Contents: Pair of Running Shoes</span></li>\n</ul>\n",
			"short_description": "",
			"sku": "",
			"price": "0",
			"regular_price": "",
			"sale_price": "",
			"date_on_sale_from": null,
			"date_on_sale_from_gmt": null,
			"date_on_sale_to": null,
			"date_on_sale_to_gmt": null,
			"on_sale": true,
			"purchasable": true,
			"total_sales": 0,
			"virtual": false,
			"downloadable": false,
			"downloads": [],
			"download_limit": -1,
			"download_expiry": -1,
			"external_url": "",
			"button_text": "",
			"tax_status": "taxable",
			"tax_class": "",
			"manage_stock": true,
			"stock_quantity": 40,
			"backorders": "no",
			"backorders_allowed": false,
			"backordered": false,
			"low_stock_amount": 10,
			"sold_individually": false,
			"weight": "0.5",
			"dimensions": {
				"length": "17",
				"width": "4",
				"height": "5"
			},
			"shipping_required": true,
			"shipping_taxable": true,
			"shipping_class": "a",
			"shipping_class_id": 79,
			"reviews_allowed": true,
			"average_rating": "0.00",
			"rating_count": 0,
			"upsell_ids": [],
			"cross_sell_ids": [],
			"parent_id": 0,
			"purchase_note": "",
			"categories": [
				{
					"id": 49,
					"name": "Footwear",
					"slug": "footwear"
				},
				{
					"id": 24,
					"name": "Men",
					"slug": "men"
				},
				{
					"id": 27,
					"name": "Women",
					"slug": "women"
				}
			],
			"tags": [
				{
					"id": 51,
					"name": "Adidas",
					"slug": "adidas"
				},
				{
					"id": 104,
					"name": "footwear",
					"slug": "footwear"
				},
				{
					"id": 102,
					"name": "Mens",
					"slug": "mens"
				},
				{
					"id": 101,
					"name": "Sports Shoe",
					"slug": "sports-shoe"
				}
			],
			"images": [
				{
					"id": 3426,
					"date_created": "2021-10-12T16:16:30",
					"date_created_gmt": "2021-10-12T16:16:30",
					"date_modified": "2021-10-12T16:16:46",
					"date_modified_gmt": "2021-10-12T16:16:46",
					"src": "https://woo-store1.blynklive.com/wp-content/uploads/2021/10/Screenshot-2021-10-12-8.53.29-PM.png",
					"name": "Adidas Shoes",
					"alt": ""
				}
			],
			"attributes": [
				{
					"id": 2,
					"name": "size",
					"position": 0,
					"visible": true,
					"variation": true,
					"options": ["10", "6", "7", "8", "9"]
				},
				{
					"id": 1,
					"name": "color",
					"position": 1,
					"visible": true,
					"variation": true,
					"options": ["black", "red", "white"]
				}
			],
			"default_attributes": [],
			"variations": [
				3463, 3464, 3465, 3466, 3467, 3468, 3469, 3470, 3471, 3472, 3473, 3474, 3475, 3476,
				3477
			],
			"grouped_products": [],
			"menu_order": 0,
			"price_html": "<span class=\"woocommerce-Price-amount amount\"><bdi><span class=\"woocommerce-Price-currencySymbol\">&#36;</span>0</bdi></span> &ndash; <span class=\"woocommerce-Price-amount amount\"><bdi><span class=\"woocommerce-Price-currencySymbol\">&#36;</span>440</bdi></span> <small class=\"woocommerce-price-suffix\">ex VAT</small>",
			"related_ids": [115, 3394, 307, 112, 349],
			"meta_data": [
				{
					"id": 9771,
					"key": "site-sidebar-layout",
					"value": "default"
				},
				{
					"id": 9772,
					"key": "site-content-layout",
					"value": "default"
				},
				{
					"id": 9773,
					"key": "theme-transparent-header-meta",
					"value": "default"
				}
			],
			"stock_status": "instock",
			"_links": {
				"self": [
					{
						"href": "https://woo-store1.blynklive.com/wp-json/wc/v3/products/3424"
					}
				],
				"collection": [
					{
						"href": "https://woo-store1.blynklive.com/wp-json/wc/v3/products"
					}
				]
			}
		},
		{
			"id": 3418,
			"name": "Adidas Men's Adilette Comfort Flip Flop",
			"slug": "adidas-mens-adilette-comfort-flip-flop",
			"permalink": "https://woo-store1.blynklive.com/product/adidas-mens-adilette-comfort-flip-flop/",
			"date_created": "2021-10-12T15:54:47",
			"date_created_gmt": "2021-10-12T15:54:47",
			"date_modified": "2021-10-27T10:54:11",
			"date_modified_gmt": "2021-10-27T10:54:11",
			"type": "variable",
			"status": "publish",
			"featured": false,
			"catalog_visibility": "visible",
			"description": "<ul class=\"a-unordered-list a-vertical a-spacing-mini\">\n<li><span class=\"a-list-item\">Closure: Slip On</span></li>\n<li><span class=\"a-list-item\">Shoe Width: Regular</span></li>\n<li><span class=\"a-list-item\">Outer Material: Synthetic</span></li>\n<li><span class=\"a-list-item\">Closure Type: Slip On</span></li>\n<li><span class=\"a-list-item\">Toe Style: Open Toe</span></li>\n<li><span class=\"a-list-item\">Warranty Type: Manufacturer &amp; Seller</span></li>\n<li><span class=\"a-list-item\">Warranty Description: 90 days</span></li>\n</ul>\n",
			"short_description": "",
			"sku": "",
			"price": "140.99",
			"regular_price": "",
			"sale_price": "",
			"date_on_sale_from": null,
			"date_on_sale_from_gmt": null,
			"date_on_sale_to": null,
			"date_on_sale_to_gmt": null,
			"on_sale": true,
			"purchasable": true,
			"total_sales": 0,
			"virtual": false,
			"downloadable": false,
			"downloads": [],
			"download_limit": -1,
			"download_expiry": -1,
			"external_url": "",
			"button_text": "",
			"tax_status": "taxable",
			"tax_class": "",
			"manage_stock": true,
			"stock_quantity": 40,
			"backorders": "no",
			"backorders_allowed": false,
			"backordered": false,
			"low_stock_amount": 2,
			"sold_individually": false,
			"weight": "1.5",
			"dimensions": {
				"length": "11",
				"width": "11",
				"height": "11"
			},
			"shipping_required": true,
			"shipping_taxable": true,
			"shipping_class": "",
			"shipping_class_id": 0,
			"reviews_allowed": true,
			"average_rating": "0.00",
			"rating_count": 0,
			"upsell_ids": [],
			"cross_sell_ids": [],
			"parent_id": 0,
			"purchase_note": "",
			"categories": [
				{
					"id": 49,
					"name": "Footwear",
					"slug": "footwear"
				},
				{
					"id": 24,
					"name": "Men",
					"slug": "men"
				}
			],
			"tags": [
				{
					"id": 51,
					"name": "Adidas",
					"slug": "adidas"
				},
				{
					"id": 104,
					"name": "footwear",
					"slug": "footwear"
				},
				{
					"id": 50,
					"name": "Shoes",
					"slug": "shoes"
				},
				{
					"id": 103,
					"name": "slippers",
					"slug": "slippers"
				}
			],
			"images": [
				{
					"id": 3423,
					"date_created": "2021-10-12T15:54:23",
					"date_created_gmt": "2021-10-12T15:54:23",
					"date_modified": "2021-10-12T15:54:38",
					"date_modified_gmt": "2021-10-12T15:54:38",
					"src": "https://woo-store1.blynklive.com/wp-content/uploads/2021/10/Screenshot-2021-10-12-9.17.57-PM.png",
					"name": "Flip- flops",
					"alt": ""
				}
			],
			"attributes": [
				{
					"id": 2,
					"name": "size",
					"position": 0,
					"visible": true,
					"variation": true,
					"options": ["10", "6", "7", "8", "9"]
				},
				{
					"id": 1,
					"name": "color",
					"position": 1,
					"visible": true,
					"variation": true,
					"options": ["black", "red", "white"]
				},
				{
					"id": 0,
					"name": "Sex",
					"position": 2,
					"visible": true,
					"variation": true,
					"options": ["Male", "Female"]
				}
			],
			"default_attributes": [],
			"variations": [
				3487, 3488, 3489, 3490, 3491, 3492, 3478, 3479, 3480, 3481, 3482, 3483, 3484, 3485,
				3486
			],
			"grouped_products": [],
			"menu_order": 0,
			"price_html": "<span class=\"woocommerce-Price-amount amount\"><bdi><span class=\"woocommerce-Price-currencySymbol\">&#36;</span>141</bdi></span> <small class=\"woocommerce-price-suffix\">ex VAT</small>",
			"related_ids": [362, 3323, 112, 3401, 307],
			"meta_data": [
				{
					"id": 9705,
					"key": "site-sidebar-layout",
					"value": "default"
				},
				{
					"id": 9706,
					"key": "site-content-layout",
					"value": "default"
				},
				{
					"id": 9707,
					"key": "theme-transparent-header-meta",
					"value": "default"
				}
			],
			"stock_status": "instock",
			"_links": {
				"self": [
					{
						"href": "https://woo-store1.blynklive.com/wp-json/wc/v3/products/3418"
					}
				],
				"collection": [
					{
						"href": "https://woo-store1.blynklive.com/wp-json/wc/v3/products"
					}
				]
			}
		},
		{
			"id": 2997,
			"name": "USB Stick",
			"slug": "usb-stick",
			"permalink": "https://woo-store1.blynklive.com/product/usb-stick/",
			"date_created": "2021-07-22T11:57:23",
			"date_created_gmt": "2021-07-22T11:57:23",
			"date_modified": "2021-07-22T12:13:34",
			"date_modified_gmt": "2021-07-22T12:13:34",
			"type": "grouped",
			"status": "publish",
			"featured": false,
			"catalog_visibility": "visible",
			"description": "<p>Compact USB stick with flash memory. Water and dust proof.Light weight. Comes with different memory sizes.</p>\n",
			"short_description": "<p>Compact USB stick with flash memory</p>\n",
			"sku": "g1",
			"price": "20",
			"regular_price": "",
			"sale_price": "",
			"date_on_sale_from": null,
			"date_on_sale_from_gmt": null,
			"date_on_sale_to": null,
			"date_on_sale_to_gmt": null,
			"on_sale": true,
			"purchasable": false,
			"total_sales": 0,
			"virtual": false,
			"downloadable": false,
			"downloads": [],
			"download_limit": -1,
			"download_expiry": -1,
			"external_url": "",
			"button_text": "",
			"tax_status": "taxable",
			"tax_class": "",
			"manage_stock": false,
			"stock_quantity": null,
			"backorders": "no",
			"backorders_allowed": false,
			"backordered": false,
			"low_stock_amount": null,
			"sold_individually": false,
			"weight": "",
			"dimensions": {
				"length": "",
				"width": "",
				"height": ""
			},
			"shipping_required": true,
			"shipping_taxable": true,
			"shipping_class": "",
			"shipping_class_id": 0,
			"reviews_allowed": true,
			"average_rating": "0.00",
			"rating_count": 0,
			"upsell_ids": [],
			"cross_sell_ids": [],
			"parent_id": 0,
			"purchase_note": "",
			"categories": [
				{
					"id": 53,
					"name": "Electronics",
					"slug": "electronics"
				}
			],
			"tags": [],
			"images": [
				{
					"id": 2998,
					"date_created": "2021-07-22T11:55:14",
					"date_created_gmt": "2021-07-22T11:55:14",
					"date_modified": "2021-07-22T11:56:20",
					"date_modified_gmt": "2021-07-22T11:56:20",
					"src": "https://woo-store1.blynklive.com/wp-content/uploads/2021/07/sandisk-usb.jpeg",
					"name": "sandisk-usb",
					"alt": "sandisk-usb"
				}
			],
			"attributes": [],
			"default_attributes": [],
			"variations": [],
			"grouped_products": [3000, 3002, 3004],
			"menu_order": 0,
			"price_html": "<span class=\"woocommerce-Price-amount amount\"><bdi><span class=\"woocommerce-Price-currencySymbol\">&#36;</span>20</bdi></span> &ndash; <span class=\"woocommerce-Price-amount amount\"><bdi><span class=\"woocommerce-Price-currencySymbol\">&#36;</span>60</bdi></span> <small class=\"woocommerce-price-suffix\">ex VAT</small>",
			"related_ids": [3332, 3308, 3008, 3262, 3344],
			"meta_data": [
				{
					"id": 3878,
					"key": "_last_editor_used_jetpack",
					"value": "classic-editor"
				},
				{
					"id": 3885,
					"key": "_wp_page_template",
					"value": "default"
				},
				{
					"id": 3886,
					"key": "cartflows_redirect_flow_id",
					"value": ""
				},
				{
					"id": 3887,
					"key": "cartflows_add_to_cart_text",
					"value": ""
				},
				{
					"id": 3905,
					"key": "site-sidebar-layout",
					"value": "default"
				},
				{
					"id": 3906,
					"key": "site-content-layout",
					"value": "default"
				},
				{
					"id": 3907,
					"key": "theme-transparent-header-meta",
					"value": "default"
				}
			],
			"stock_status": "instock",
			"_links": {
				"self": [
					{
						"href": "https://woo-store1.blynklive.com/wp-json/wc/v3/products/2997"
					}
				],
				"collection": [
					{
						"href": "https://woo-store1.blynklive.com/wp-json/wc/v3/products"
					}
				]
			}
		},
		{
			"id": 3401,
			"name": "Flash kids T-shirt",
			"slug": "flash-kids-t-shirt",
			"permalink": "https://woo-store1.blynklive.com/product/flash-kids-t-shirt/",
			"date_created": "2021-10-12T15:20:04",
			"date_created_gmt": "2021-10-12T15:20:04",
			"date_modified": "2021-10-28T06:49:57",
			"date_modified_gmt": "2021-10-28T06:49:57",
			"type": "variable",
			"status": "publish",
			"featured": false,
			"catalog_visibility": "visible",
			"description": "<ul class=\"a-unordered-list a-vertical a-spacing-mini\">\n<li><span class=\"a-list-item\">Care Instructions: Hand Wash Only</span></li>\n<li><span class=\"a-list-item\">Fit Type: regular fit</span></li>\n<li><span class=\"a-list-item\">Color Name: Multicolor</span></li>\n<li><span class=\"a-list-item\">100% Cotton</span></li>\n<li><span class=\"a-list-item\">Half sleeve</span></li>\n<li><span class=\"a-list-item\">Hand wash</span></li>\n</ul>\n",
			"short_description": "",
			"sku": "Flash Super hero",
			"price": "48.00",
			"regular_price": "",
			"sale_price": "",
			"date_on_sale_from": null,
			"date_on_sale_from_gmt": null,
			"date_on_sale_to": null,
			"date_on_sale_to_gmt": null,
			"on_sale": true,
			"purchasable": true,
			"total_sales": 0,
			"virtual": false,
			"downloadable": false,
			"downloads": [],
			"download_limit": -1,
			"download_expiry": -1,
			"external_url": "",
			"button_text": "",
			"tax_status": "taxable",
			"tax_class": "us",
			"manage_stock": true,
			"stock_quantity": 40,
			"backorders": "no",
			"backorders_allowed": false,
			"backordered": false,
			"low_stock_amount": 2,
			"sold_individually": false,
			"weight": ".5",
			"dimensions": {
				"length": "10",
				"width": "11",
				"height": "12"
			},
			"shipping_required": true,
			"shipping_taxable": true,
			"shipping_class": "",
			"shipping_class_id": 0,
			"reviews_allowed": true,
			"average_rating": "4.50",
			"rating_count": 2,
			"upsell_ids": [],
			"cross_sell_ids": [],
			"parent_id": 0,
			"purchase_note": "",
			"categories": [
				{
					"id": 45,
					"name": "Clothing",
					"slug": "clothing"
				},
				{
					"id": 90,
					"name": "kids",
					"slug": "kids"
				},
				{
					"id": 24,
					"name": "Men",
					"slug": "men"
				}
			],
			"tags": [
				{
					"id": 95,
					"name": "flash",
					"slug": "flash"
				},
				{
					"id": 92,
					"name": "kids",
					"slug": "kids"
				},
				{
					"id": 84,
					"name": "super hero",
					"slug": "super-hero"
				},
				{
					"id": 91,
					"name": "t-shirt",
					"slug": "t-shirt"
				}
			],
			"images": [
				{
					"id": 3403,
					"date_created": "2021-10-12T15:18:28",
					"date_created_gmt": "2021-10-12T15:18:28",
					"date_modified": "2021-10-12T15:18:39",
					"date_modified_gmt": "2021-10-12T15:18:39",
					"src": "https://woo-store1.blynklive.com/wp-content/uploads/2021/10/Screenshot-2021-10-12-8.46.19-PM.png",
					"name": "Flash",
					"alt": ""
				},
				{
					"id": 3526,
					"date_created": "2021-10-19T07:55:29",
					"date_created_gmt": "2021-10-19T07:55:29",
					"date_modified": "2021-10-19T07:55:29",
					"date_modified_gmt": "2021-10-19T07:55:29",
					"src": "https://woo-store1.blynklive.com/wp-content/uploads/2021/10/Screenshot-2021-10-19-1.25.05-PM.png",
					"name": "Screenshot 2021-10-19 1.25.05 PM",
					"alt": ""
				},
				{
					"id": 3527,
					"date_created": "2021-10-19T07:55:32",
					"date_created_gmt": "2021-10-19T07:55:32",
					"date_modified": "2021-10-19T07:55:32",
					"date_modified_gmt": "2021-10-19T07:55:32",
					"src": "https://woo-store1.blynklive.com/wp-content/uploads/2021/10/Screenshot-2021-10-19-1.24.43-PM.png",
					"name": "Screenshot 2021-10-19 1.24.43 PM",
					"alt": ""
				}
			],
			"attributes": [
				{
					"id": 2,
					"name": "size",
					"position": 0,
					"visible": true,
					"variation": true,
					"options": ["L", "M", "S", "XL", "XXL"]
				}
			],
			"default_attributes": [],
			"variations": [3521, 3522, 3523, 3524, 3525],
			"grouped_products": [],
			"menu_order": 0,
			"price_html": "<del aria-hidden=\"true\"><span class=\"woocommerce-Price-amount amount\"><bdi><span class=\"woocommerce-Price-currencySymbol\">&#36;</span>50</bdi></span></del> <ins><span class=\"woocommerce-Price-amount amount\"><bdi><span class=\"woocommerce-Price-currencySymbol\">&#36;</span>48</bdi></span></ins> <small class=\"woocommerce-price-suffix\">ex VAT</small>",
			"related_ids": [3394, 3399, 3267, 349, 3358],
			"meta_data": [
				{
					"id": 9401,
					"key": "site-sidebar-layout",
					"value": "left-sidebar"
				},
				{
					"id": 9402,
					"key": "site-content-layout",
					"value": "default"
				},
				{
					"id": 9403,
					"key": "theme-transparent-header-meta",
					"value": "default"
				}
			],
			"stock_status": "instock",
			"_links": {
				"self": [
					{
						"href": "https://woo-store1.blynklive.com/wp-json/wc/v3/products/3401"
					}
				],
				"collection": [
					{
						"href": "https://woo-store1.blynklive.com/wp-json/wc/v3/products"
					}
				]
			}
		}
	]
}
